tap "hewigovens/tap"

brew "fish"
brew "mas"
brew "difftastic"
brew "delta"
brew "tree"
brew "gh"
brew "uv"
brew "fnm"
brew "codex"
brew "mergiraf"
brew "wakeonlan"
brew "lazygit"
brew "zellij"
brew "just"

# Productivity
cask "microsoft-edge"
cask "1password"
cask "spotify"
cask "signal"
cask "chatgpt"
cask "legcord"
cask "typora"

# Utilities
cask "raycast"
cask "obsidian"
cask "rectangle"
cask "suspicious-package"
cask "daisydisk"
cask "pearcleaner"
cask "pdf-expert"
cask "bettermouse"

# Dev
cask "ghostty"
cask "visual-studio-code"
cask "proxyman"
cask "github"
cask "tailscale"
cask "xcodes"
cask "orbstack"
cask "hopper-disassembler"
cask "claude-code"
cask "codex-app"
cask "jayjay"

# Fonts
cask "font-fira-code"
cask "font-cascadia-code"

# https://apps.apple.com/us/app/telegram/id747648890?mt=12
mas "Telegram", id: 747648890
# https://apps.apple.com/us/app/irvue/id1039633667?mt=12
mas "Irvue", id: 1039633667
# https://apps.apple.com/us/app/gapplin/id768053424?mt=12
mas "Gapplin", id: 768053424
# https://apps.apple.com/us/app/shadowrocket/id932747118
mas "Shadowrocket", id: 932747118
# https://apps.apple.com/us/app/ublock-origin-lite/id6745342698
mas "uBlock Origin Lite", id: 6745342698
# https://apps.apple.com/us/app/localsend/id1661733229
mas "LocalSend", id: 1661733229
# https://apps.apple.com/us/app/hidden-bar/id1452453066
mas "Hidden Bar", id: 1452453066
