brew "fish"
brew "git-lfs"
brew "mas"
brew "difftastic"
brew "wget"
brew "tree"
brew "gh"
brew "uv"
brew "nvm"

# Productivity
cask "microsoft-edge"
cask "1password"
cask "spotify"
cask "signal"
cask "chatgpt"
cask "claude"
cask "dropbox"

# Utilities
cask "raycast"
cask "hiddenbar"
cask "obsidian"
cask "rectangle"
cask "suspicious-package"
cask "daisydisk"
cask "pearcleaner"
cask "topnotch"
cask "monitorcontrol"

# Dev
cask "iterm2"
cask "ghostty"
cask "visual-studio-code"
cask "proxyman"
cask "github"
cask "cursor"
cask "tailscale"
cask "xcodes"
cask "github-copilot-for-xcode"
cask "swiftformat-for-xcode"
cask "orbstack"
cask "rapidapi"
cask "ollama"

# Fonts
cask "font-fira-code"
cask "font-cascadia-code"
cask "font-maple-mono-nf-cn"
cask "font-meslo-for-powerlevel10k"

# https://apps.apple.com/us/app/telegram/id747648890?mt=12
mas "Telegram", id: 747648890
# https://apps.apple.com/us/app/irvue/id1039633667?mt=12
mas "Irvue", id: 1039633667
# https://apps.apple.com/us/app/gapplin/id768053424?mt=12
mas "Gapplin", id: 768053424
# https://apps.apple.com/us/app/shadowrocket/id932747118
mas "Shadowrocket", id: 932747118
# https://apps.apple.com/us/app/immersive-translate-for-safari/id6447957425
mas "Immersive Translate for Safari", id: 6447957425
# https://apps.apple.com/us/app/localsend/id1661733229
mas "LocalSend", id: 1661733229
