brew "fish"
brew "git-lfs"
brew "mas"
brew "difftastic"
brew "wget"
brew "tree"
brew "rustup-init"
brew "gh"

cask "iterm2"
cask "ghostty"
cask "font-fira-code"
cask "font-cascadia-code"
cask "visual-studio-code"
cask "microsoft-edge"
cask "1password"
cask "github"
cask "proxyman"
cask "raycast"
cask "hiddenbar"
cask "obsidian"
cask "rectangle"
cask "rapidapi"
cask "suspicious-package"
cask "daisydisk"

# https://apps.apple.com/us/app/telegram/id747648890?mt=12
mas "Telegram", id: 747648890
# https://apps.apple.com/us/app/irvue/id1039633667?mt=12
mas "Irvue", id: 1039633667
# https://apps.apple.com/us/app/gapplin/id768053424?mt=12
mas "Gapplin", id: 768053424
# https://apps.apple.com/us/app/shadowrocket/id932747118
mas "Shadowrocket", id: 932747118
# https://apps.apple.com/us/app/immersive-translate-for-safari/id6447957425
mas "Immersive Translate for Safari", id: 6447957425
